music_app/app/controllers/bands_controller.rb

    def update
        @band = Band.find(params[:id])

        if @band.update_attributes(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "band amazing"], ["updated_at", "2021-07-27 20:24:20.049074"], ["id", 1]]